<?php

namespace Database\Seeders;

use App\Models\SmefCluster;
use Illuminate\Database\Seeder;
use Illuminate\Support\Facades\Schema;

class SmefClusterSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {
        Schema::disableForeignKeyConstraints();
        SmefCluster::query()->truncate();

        $clusters = [
            "বলদিয়া ক্রিকেট ব্যাট ক্লাস্টার, নেছারাবাদ ( পিরোজপুর )",
            "লেদার ক্লাস্টার, পীরবাড়ি ( ব্রাম্মাণবড়িয়া )",
            "লাইট ইঞ্জিনিয়ারিং ক্লাস্টার, স্টেশন রোড ( কুমিল্লা )",
            "মৃৎশিল্প ক্লাস্টার, বিজয়পুর-নওয়াপাড়া-বারোপাড়া ( কুমিল্লা )",
            "উড ক্লাস্টার, ছাগলনাইয়া ( ফেনী )",
            "হ্যান্ডিক্রাফট ক্লাস্টার, লক্ষীপুর সদর ( লক্ষীপুর )",
            "লেদার ক্লাস্টার, পূর্বমাদারবাড়ি ( চট্টগ্রাম )",
            "বল্লা তাঁতবস্ত্র ক্লাস্টার ( টাঙ্গাইল )",
            "হামিদপুর, কালিহাতি অটোরাইসমিল ক্লাস্টার ( টাঙ্গাইল )",
            "ভৈরব পাদুকা শিল্প ক্লাস্টার ( কিশোরগঞ্জ )",
            "শ্যামপুর-কদমতলী ইলেকট্রনিক্স ক্লাস্টার ( ঢাকা )",
            "শাঁওইল হ্যান্ডলুম ক্লাস্টার, আদমদীঘি ( বগুড়া )",
            "পাতরাইল তাঁতবস্ত্র ক্লাস্টার, দেলদুয়ার ( টাঙ্গাইল )",
            "ধোলাইখাল লাইট ইঞ্জিনিয়ারিং ক্লাস্টার ( ঢাকা )",
            "ঘিওর বাঁশ ও বেত ক্লাস্টার ( মানিকগঞ্জ )",
            "ডাইং ও প্রিন্টিং ক্লাস্টার, নরসিংদী সদর ( নরসিংদী )",
            "এগ্রো প্রসেসিং ক্লাস্টার, ফরিদপুর সদর ( ফরিদপুর )",
            "গার্মেন্টস ক্লাস্টার ( মুন্সিগঞ্জ )",
            "কামরাঙ্গিচর প্লাস্টিক ক্লাস্টার ( ঢাকা )",
            "লাইট ইঞ্জিনিয়ারিং ক্লাস্টার ( কিশোরগঞ্জ )",
            "নিটওয়্যার ক্লাস্টার, কোনাবড়ি ( গাজীপুর )",
            "এগ্রো প্রসেসিং ক্লাস্টার, নারায়নগঞ্জ ( নারায়নগঞ্জ )",
            "নিটওয়্যার ক্লাস্টার, নারায়নগঞ্জ ( নারায়নগঞ্জ )",
            "পিভিসি পাইপ ক্লাস্টার, বংশাল ( ঢাকা )",
            "চকবাজার প্লাস্টিক ক্লাস্টার ( ঢাকা )",
            "ডায়াগনিসটিক সেন্টার ক্লাস্টার, টাঙ্গাইল সদর ( টাঙ্গাইল )",
            "ফ্যাশন প্রোডাক্ট ক্লাস্টার, মিরপুর ( ঢাকা )",
            "সু ক্লাস্টার, পল্লবী, মিরপুর ( ঢাকা )",
            "প্লাষ্টিক শিল্প ক্লাস্টার, ইসলামবাগ ( ঢাকা )",
            "রাইসমিল শিল্প ক্লাস্টার, ঘাটাইল ( টাঙ্গাইল )",
            "পাদুকা শিল্প ক্লাস্টার, সিদ্দিকবাজার ( ঢাকা )",
            "সোয়েটার ক্লাস্টার, গাজীপুর সদর ( গাজীপুর )",
            "টেক্সটাইল ক্লাস্টার, মাধবদী ( নরসিংদী )",
            "টেক্সটাইল মিল ক্লাস্টার, নরসিংদী সদর ( নরসিংদী )"
        ];

        $clusters = array_map(function ($title) {
            return [
                "title" => $title
            ];
        }, $clusters);

        SmefCluster::insert($clusters);
        Schema::disableForeignKeyConstraints();

    }
}
